Tekla Open API Reference for Tekla Structures 2025
Events.HiddenObjectsChanged Event
 Occurs when user hides an object or view is redrawn
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.HiddenObjectsChangedDelegate HiddenObjectsChanged
Public Event HiddenObjectsChanged As Events.HiddenObjectsChangedDelegate
Value
Type: Tekla.Structures.Model.Events.HiddenObjectsChangedDelegate
See Also
Reference
Events Class
Tekla.Structures.Model Namespace